Tekla Open API Reference for Tekla Structures 2025
StringList.LastIndexOf Method
Overload List
Name | Description
LastIndexOf(String)
 Searches for the last occurence of the string in the list.
LastIndexOf(String, Int32)
 Searches for the last occurence of the string in the list.
LastIndexOf(String, Int32, Int32)
 Searches for the last occurence of the string in the list.
Top
See Also
Reference
StringList Class
Tekla.Structures.Drawing Namespace